[{"title":"ddddddd","date":"2017-12-13T08:39:41.000Z","path":"cjb4u3h3z0002il2ppyam0lxn/","text":"","tags":[]},{"title":"博客文集《前方的路》发布","date":"2017-12-08T12:02:56.000Z","path":"cjb4u3h46000ail2pdevgrqxl/","text":"我写博客十多年了，从一个愤青 + 文青的学生，变成如今沉默寡言的中年人。一路上，随手写下的文字，累积有1000多篇。我早想整理出书，一方面为了纪念，另一方面现在的博客网站不易用，老文章很难找，迫切需要一个便于查找和阅读的精华版。This is an example inline link. 第一格表头 第二格表头 内容单元格 第一列第一格 内容单元格第二列第一格 内容单元格 第一列第二格 多加文字 内容单元格第二列第二格 三年前，我整理过一次，也出版了，书名是《如何变得有思想》。那本书的可读性很差，文章按主题分类（人物篇、历史篇、科技篇……）。我后来醒悟，这样做是不对的。我要给读者看的是一个故事，就是我的故事，而不是一篇篇零散的文章。 今年，我投入很多时间，把过去的文章按照时间排序，重新编成一本书。书名改成《前方的路》，出自黑塞的小说《德米安》，意为寻找人生的出路。 明年，这本书会和《未来世界的幸存者》一起出版。我跟出版社建议，可以做成一套两卷本的《阮一峰文集》。 古人说，人生要立功、立德、立言。完成了这两本书，我就”立言”了。想说的话都说了，以后会少说多做，专心搞技术，完成几个真正有用的技术项目。 st=>start: Start|past:>http://www.google.com[blank] e=>end: End:>http://www.google.com op1=>operation: My Operation|past op2=>operation: Stuff|current sub1=>subroutine: My Subroutine|invalid cond=>condition: Yes or No?|approved:>http://www.google.com c2=>condition: Good idea|rejected io=>inputoutput: catch something...|request st->op1(right)->cond cond(yes, right)->c2 cond(no)->sub1(left)->op1 c2(yes)->io->e c2(no)->op2->e{\"scale\":1,\"line-width\":2,\"line-length\":50,\"text-margin\":10,\"font-size\":12} var code = document.getElementById(\"flowchart-0-code\").value; var options = JSON.parse(decodeURIComponent(document.getElementById(\"flowchart-0-options\").value)); var diagram = flowchart.parse(code); diagram.drawSVG(\"flowchart-0\", options);","tags":[{"name":"ES6","slug":"ES6","permalink":"https://vevlins.github.io/tags/ES6/"},{"name":"博客","slug":"博客","permalink":"https://vevlins.github.io/tags/博客/"}]},{"title":"Afghan leader Ashraf Ghani apologises for headscarf remark","date":"2017-12-03T16:04:02.000Z","path":"cjb4u3h3v0000il2pf8u49z31/","text":"The Afghan president has apologised to women for remarks he made about the traditional headscarf. On Saturday, Ashraf Ghani responded to claims that some government officials have links to so-called Islamic State. He said people should provide evidence or wear a woman’s headscarf. It provoked a backlash from people who viewed the comments as sexist. Mr Ghani later apologised to women who felt offended and said his comments had been misinterpreted. In a statement, the Afghan presidential palace said: “The president is a very prominent advocate of women’s rights and has taken unique steps to strengthen and preserve their position since his tenure as the president of Afghanistan.” Afghan president has ‘worst job on Earth’ Who is Ashraf Ghani? It said Mr Ghani’s use of the word “Chaadar”, scarf in English, had been misinterpreted. It is “a common saying which is never aimed to offend the highly valuable place of women in the country,” it added.","tags":[{"name":"Afghan","slug":"Afghan","permalink":"https://vevlins.github.io/tags/Afghan/"}]},{"title":"Trump-Russia- Michael Flynn admits lying to FBI","date":"2017-11-30T08:47:25.147Z","path":"cjb4u3h450007il2pnzs8jkmi/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post #include&lt;stdio.h&gt; int main(){ printf(&quot;Hello World&quot;); exit(0); } $ hexo new &quot;My New Post&quot; More info: Writing Run servera.each() More info: Server Generate static files$ hexo generate More info: Generating Deploy to remote sites$ hexo deploy More info: Deployment","tags":[{"name":"web","slug":"web","permalink":"https://vevlins.github.io/tags/web/"},{"name":"sass","slug":"sass","permalink":"https://vevlins.github.io/tags/sass/"}]},{"title":"ABC's Brian Ross suspended for erroneous report on Flynn plea deal","date":"2015-12-03T16:05:34.000Z","path":"cjb4u3h430005il2p0c4t7kh5/","text":"US news network ABC has suspended its chief investigative reporter after he made a “serious error” about Donald Trump’s former top aide, Michael Flynn. Brian Ross reported Mr Trump was a candidate when he directed Michael Flynn to make contact with Moscow.But he later clarified that the orders came when Mr Trump was president-elect. The actions of Mr Trump’s campaign team are under investigation over whether they colluded with Russia to help sway the election in his favour.On Friday, Michael Flynn - who Mr Trump sacked as national security adviser - pleaded guilty to lying to the FBI about his contacts with Russian officials prior to the president’s inauguration in January. Six big takeaways from the Flynn deal Russia-Trump: Who&#39;s who in the drama to end all dramas? The Trump-Russia saga in 200 words As part of a plea bargain, Mr Flynn agreed to co-operate with special prosecutor Robert Mueller’s investigation into possible collusion between the Trump campaign and Russia ahead of the 2016 election. US intelligence agencies have already concluded that Russian President Vladimir Putin directed a state effort to influence the US election in favour of Mr Trump. President Trump has repeatedly denied any involvement, and tweeted on Sunday that he had never asked former FBI director James Comey to stop the investigation into Mr Flynn.What did the original report say? Brian Ross’s special report was aired after Mr Flynn’s plea deal was announced on Friday. Quoting a single anonymous source, it said he was prepared to testify that Mr Trump had directed him to make contact with Russian officials when he was still a candidate for the presidency. If found true, the claim would have conflicted with the president’s comments at the time of Mr Flynn’s sacking earlier this year. In February, he told reporters: “No, I didn’t direct him, but I would have directed him if he didn’t do it, okay?” Off the back of the report, Wall Street’s main indexes fell by more than one percent.Why was a correction issued? In a later edition of ABC’s World News Tonight, Mr Ross clarified that his source had in fact said that Donald Trump’s orders came during the presidential transition, after the election had taken place. “It was shortly after the election that President-elect Trump directed Flynn to contact Russian officials on topics that included working jointly against ISIS (so-called Islamic State),” he said. But the news network was criticised for simply clarifying the error and was later forced to issue a full correction.Skip Twitter post by @ABC .@ABC News statement on Michael Flynn report: https://t.co/sd9TeFiiLQ pic.twitter.com/UtHFHeuwcM — ABC News (@ABC) December 2, 2017 Report End of Twitter post by @ABC President Trump was quick to praise the move, and suggested the report was part of a “fake news” agenda set against him.Skip Twitter post by @realDonaldTrump Congratulations to @ABC News for suspending Brian Ross for his horrendously inaccurate and dishonest report on the Russia, Russia, Russia Witch Hunt. More Networks and “papers” should do the same with their Fake News! — Donald J. Trump (@realDonaldTrump) December 3, 2017 Report End of Twitter post by @realDonaldTrump Mr Ross, 69, also took to Twitter to comment on the mistake, saying: “My job is to hold people accountable and that’s why I agree with being held accountable myself.” The journalist has been criticised in the past for previous errors, including suggesting that the gunman in a mass shooting at a cinema in Colorado had a connection to the conservative Tea Party group.Related Topics Donald Trump Russia-Trump inquiry Share this story About sharing Email Facebook Messenger Twitter Pinterest LinkedIn More on this story Trump-Russia saga in 200 words 1 December 2017 Trump-Russia: Six big takeaways from the Flynn deal 1 December 2017 Video Crowds shout at ex-Trump adviser Michael Flynn at court 1 December 2017 Russia-Trump: Who&#39;s who in the drama to end all dramas? 1 December 2017 Video Michael Flynn: The man at the centre of Trump’s Russia crisis 5 June 2017 US &amp; CanadaUS ‘in race to address N Korea threat’ 3 December 2017 From the section US &amp; Canada Full article US ‘in race to address N Korea threat’Metropolitan Opera investigates abuse claims 3 December 2017 From the section Entertainment &amp; Arts Full article Metropolitan Opera investigates abuse claimsTrump says Flynn’s Russia dealings lawful 3 December 2017 From the section US &amp; Canada Full article Trump says Flynn’s Russia dealings lawfulTop StoriesTrump lashes out at FBI over Russia probe In a Twitter tirade, the president issues a fresh denial that he tried to obstruct FBI investigation.23 minutes agoThirteen dead in S Korea boat crash8 hours agoSmog halts cricket Test in Delhi5 hours agoFeaturesFrom tropical rice fields to Olympic ice The Tibetan Muslims who made Kashmir home VideoLighting dark skin for the screen VideoSaudi House of Cards Miguel, sex, and the apocalypse What’s different about a Trump Christmas? Heart op that took medicine into the media age Reality Check: Are 90% of Zimbabweans unemployed? VideoA coal worker’s unlikely career change Most Read 1 Russia-Trump: President hits out at FBI over Russia inquiry 2 West Coast main line faces &#39;major&#39; disruption 3 What&#39;s different about a Trump Christmas? 4 Brexit supporters list demands for &#39;divorce bill&#39; talks 5 North Korea: US in race to address threat, says HR McMaster 6 ABC&#39;s Brian Ross suspended for erroneous report on Flynn plea deal 7 &#39;Supermoon&#39; to brighten up skies for stargazers 8 Man&#39;s body found at Hawthorn High School, Pontypridd 9 Renting in retirement: How feasible is it? 10 Social mobility board quits over lack of progress","tags":[]},{"title":"Ireland has 'no desire' to delay Brexit - deputy PM","date":"2015-12-03T16:01:48.000Z","path":"cjb4u3h440006il2pnr7rwoox/","text":"Ireland’s deputy prime minister has said his country has “no desire” to delay the UK’s Brexit talks. But Simon Coveney also warned that not enough progress had been made on the border with Northern Ireland. While Ireland was not looking for “full detail”, it was seeking the parameters within which a solution could be found. His comments came ahead of a week of crucial decisions on whether the UK and EU would move ahead to the next phase of Brexit negotiations. UK Prime Minister Theresa May is due to meet European Commission President Jean-Claude Juncker on Monday to assess whether sufficient progress has been made on three core issues of citizens’ rights, the “divorce bill” and the future of the Irish border with Northern Ireland. The 27 other member states will then meet on Wednesday to make a decision on going to a second phase of talks.What does Ireland say about the border? Mr Coveney has been heavily involved with Ireland’s stance on Brexit since becoming the foreign minister during the summer. He was also appointed as tánaiste - deputy prime minister - following the resignation of his colleague, Frances Fitzgerald, over a political row that threatened to bring down the government. Speaking on the BBC’s Andrew Marr Show, he said Ireland did not want to exercise its veto on the issue. “There is no desire, I can tell you, in Ireland, to delay this process,” he said. Donec sit amet nisl. Aliquam semper ipsum sit amet velit. Suspendisse id sem consectetuer libero luctus adipiscing. “But at the same time, we have a responsibility as a government to represent the interests on the island of Ireland. “We believe that, as an island, Ireland is uniquely vulnerable and exposed to a potential bad outcome from Brexit. “That is why we are looking for more progress than we have.”","tags":[{"name":"Ireland","slug":"Ireland","permalink":"https://vevlins.github.io/tags/Ireland/"}]}]